app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (LOWER(name) LIKE LOWER('%network%'))
SELECT "products".* FROM "products"
SELECT  "products".* FROM "products" WHERE (LOWER(name) LIKE LOWER('%hello%'))  ORDER BY products.created_at DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "products" WHERE (LOWER(name) LIKE LOWER('%hello%'))
---
 def index
    @products = if params[:search]
      Product.where("LOWER(name) LIKE LOWER(?)", "%#{params[:search]}%")
    else
      Product.all
    end

    # @products = Product.all

# using traditional xhr request
    # if request.xhr?
    #   render @products
   @products = @products.order('products.created_at DESC').page(params[:page])

INSERT INTO "products" ("name", "description", "price_in_cents", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Soap"], ["description", "Bath soap"], ["price_in_cents", 5], ["created_at", "2015-09-22 20:55:43.132847"], ["updated_at", "2015-09-22 20:55:43.132847"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save